Autodesk.AdvanceSteel.ConstructionTypes.AtomicElement.HolesUsedForNumbering
Gets the status of the holes affecting this object with regards to the numbering process.
Returns: Returns returns an int since it's possible to have more than one hole pattern in a Beam or Plate, as such the state can be indeterminate.

Autodesk.AdvanceSteel.ConstructionTypes.AtomicElement.CreateACIS
Create an ACIS solid/s geometrically identical to current element
Returns: Returns a list of objects ids of the solid entities

Autodesk.AdvanceSteel.ConstructionTypes.AtomicElement.ExportToACIS(System.String)
Exports current element to ACIS SAT format file.
fileName:  Input file name to write data to
Returns: Returns 1 if successful, or 0 if not successful.

Autodesk.AdvanceSteel.ConstructionTypes.AtomicElement.GetModelerBodyList(Autodesk.AdvanceSteel.Modeler.BodyContext.eBodyContext,Autodesk.AdvanceSteel.Modeler.ModelerBody[]@)
Get a list of bodies.
bodyCtx:  The context in which the body is used.
bodies:  Output parameter representing the array of bodies.

Autodesk.AdvanceSteel.ConstructionTypes.AtomicElement.GetModeler(Autodesk.AdvanceSteel.Modeler.BodyContext.eBodyContext)
Get the body representation.
bodyCtx:  The context in which the body is used.
Returns:  Return the body.

Autodesk.AdvanceSteel.ConstructionTypes.AtomicElement.GetFeatures(System.Boolean)
Gets current object features.
bIncludeParentsFeatures:  Specify whether parents features should be returned as well.
Take a compound object for example, if "this" is a beam, do we want the compound features as well.
Returns: List of features ids.